{
  "nodes": [
    {
      "op": "null", 
      "name": "numerical_features-DHXsmuolLp", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "numerical_features-DHXsmuolLp_fullyconnected0_weight", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "numerical_features-DHXsmuolLp_fullyconnected0_bias", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "numerical_features-DHXsmuolLp_fullyconnected0", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "numerical_features-DHXsmuolLp_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat9737", 
      "attrs": {
        "dim": "1", 
        "num_args": "1"
      }, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label_ATSC8v_weight", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "label_ATSC8v_bias", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "label_ATSC8v", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ATSC8v", 
      "inputs": []
    }, 
    {
      "op": "elemwise_sub", 
      "name": "_minus9737", 
      "inputs": [[8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "_power_scalar", 
      "name": "_powerscalar9737", 
      "attrs": {"scalar": "2.0"}, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum9737", 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean9737", 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar9737", 
      "attrs": {"scalar": "1e-05"}, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div9737", 
      "inputs": [[12, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "add_n", 
      "name": "elementwisesum19475", 
      "attrs": {"num_args": "1"}, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar19475", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "add_n", 
      "name": "elementwisesum19474", 
      "attrs": {"num_args": "1"}, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar19474", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul9737", 
      "inputs": [[17, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "MakeLoss", 
      "name": "makeloss9737", 
      "attrs": {
        "normalization": "valid", 
        "valid_thresh": "1e-06"
      }, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "pred-ATSC8v", 
      "inputs": [[8, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 1, 2, 6, 7, 9], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23
  ], 
  "heads": [[21, 0, 0], [22, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10400]}
}