{
  "nodes": [
    {
      "op": "null", 
      "name": "numerical_features-br3ibUbUjh", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "numerical_features-br3ibUbUjh_fullyconnected0_weight", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "numerical_features-br3ibUbUjh_fullyconnected0_bias", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "numerical_features-br3ibUbUjh_fullyconnected0", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "numerical_features-br3ibUbUjh_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat13095", 
      "attrs": {
        "dim": "1", 
        "num_args": "1"
      }, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label_mean_jerk_in_air3_weight", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "label_mean_jerk_in_air3_bias", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "label_mean_jerk_in_air3", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mean_jerk_in_air3", 
      "inputs": []
    }, 
    {
      "op": "elemwise_sub", 
      "name": "_minus13095", 
      "inputs": [[8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "_power_scalar", 
      "name": "_powerscalar13095", 
      "attrs": {"scalar": "2.0"}, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum13095", 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean13095", 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar13095", 
      "attrs": {"scalar": "1e-05"}, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div13095", 
      "inputs": [[12, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "add_n", 
      "name": "elementwisesum26191", 
      "attrs": {"num_args": "1"}, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar26191", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "add_n", 
      "name": "elementwisesum26190", 
      "attrs": {"num_args": "1"}, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar26190", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul13095", 
      "inputs": [[17, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "MakeLoss", 
      "name": "makeloss13095", 
      "attrs": {
        "normalization": "valid", 
        "valid_thresh": "1e-06"
      }, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "pred-mean_jerk_in_air3", 
      "inputs": [[8, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 1, 2, 6, 7, 9], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23
  ], 
  "heads": [[21, 0, 0], [22, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10400]}
}